{
  "Chapathi": {
    "Ingredients": " + 2-1/2 cup whole wheat flour\n+ salt as required\n+ water as required\n+ 1 tablespoon ghee",
    "Step 1 :Knead a smooth dough": "To begin with, take a large-sized bowl. Put two cups of flour along with a cup of water, salt and ghee in it. Mix well and start kneading a dough. Make sure that the dough is not too thick nor too thin. It has to be of a soft and pliable consistency. Add water to get the consistency right. Keep kneading for a while.",
    "Step 2 : Flatten the dough balls": "Now roll out few balls from the prepared dough. Place them on a flat surface, flatten them further with the help of a rolling pin. Keep using the flour in order to prevent the rolls from sticking to the surface. Once the chapatis get the perfect round shape, place a pan on medium flame",
    "Step 3 : Cook the chapati": "Once heated enough, put the chapati on the pan and cook from both sides. Use a pair of tongs to flip over to the other side. Keep the flame to medium as too much heat might burn the chapati. Check for the little brown spots. Once they start appearing, the chapati will start to puff, indicating that it's completely cooked. Once done, transfer in a kitchen towel to keep them warm. Serve along any gravy or curry of your choice.",
    "Step 4: Note": "If you are someone who loves the richness of Ghee, then you can add some ghee while kneading the dough and with a pinch of salt this adds a nice aroma and taste to the Chapatis."
  },
  "Curry":{
    "Ingredients": "+ 3 Potatoes\n+ 2 onions\n+ 1 tomato Big\n+ 3 green chilies\n+ 1 tbsp oil\n+ 3 cloves\n+ 3 cardamoms\n+ 2 Cinnamon stick 1 Inch Pieces\n+ 1 tsp Ginger garlic paste\n+ 1 strig Curry leaves\n+ 1 pinch Fenugreek powder\n+ 1/2 glass Water\n+ 5 strigs Coriander leaves\n+ 1/2 tsp Salt\n+ 1/2 tsp Chili powder\n+ 1/2 tsp coriander powder\n+ 1/4 tsp Cumin powder\n+ 1/4 tsp garam masala powder\n+ 1/4 tsp Turmeric",
    "Step 1 ": "First, boil potatoes and peel out their skin and cut them into pieces.",
    "Step 2": "Chop onions, tomato, green chilies.",
    "Step 3":"Heat a pan add oil, cloves, cardamoms, cinnamon sticks, green chilies, onions and ginger-garlic paste, include all one by one and fry them well.",
    "Step 4": "After the onion is fried add tomato and boil it completely.",
    "Step 5": "To the boiled tomato, add all the POWDERS and mix well.    ",
    "Step 6": "Now include chopped potatoes and mix well. Fry for 2 minutes.",
    "Step 7": "Add water according to your needed consistency.",
    "Step 8": "When it starts boiling, add coriander leaves",
    "Step 9": "If you want, you can include desiccated coconut.",
    "Step 10": "Switch off the stove when it boils completely",
    "Step 11": "Delicious potato curry is all set to serve with rotis."

  }
}
